Revit 2025 API
ParameterTypeId.RebarHookRotationAtStart Property
 "Hook Rotation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarHookRotationAtStart { get; }
Public Shared ReadOnly Property RebarHookRotationAtStart As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookRotationAtStart {
	ForgeTypeId^ get ();
}
static member RebarHookRotationAtStart : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace